// 定義每個呼吸法的資料
final List<Map<String, String>> breathingInfo = [
  {
    'title': '4-7-8 呼吸法',
    'shortID': '適合在感到焦慮、無法入睡時使用',
    'detailed': '4-7-8呼吸法有助於促進身體進入深度放鬆的狀態。當你難以入睡或面臨極大壓力與焦慮時，這項技巧特別有幫助。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 7 秒',
    'exhale': '呼氣 8 秒',
  },
  {
    'title': '4-2-6 呼吸法',
    'shortID': '適合壓力大的情況下，回到平靜狀態',
    'detailed': '這種方法可以促進橫膈膜呼吸，活化迷走神經，從而降低心跳速度、促進消化，幫助身體回到平靜狀態，減少壓力和焦慮。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 2 秒',
    'exhale': '呼氣 6 秒',
  },
  {
    'title': '盒式呼吸',
    'shortID': '適合在工作或需要提升專注力時使用',
    'detailed': 'Box breathing（方形呼吸），主要用於幫助減輕壓力、提升專注力和促進放鬆。它可以幫助調節自主神經系統，減少焦慮並改善心理狀態。',
    'inhale': '吸氣 4 秒',
    'hold': '屏息 4 秒',
    'exhale': '呼氣 4 秒',
  },
  {
    'title': '3-3-3 呼吸法',
    'shortID': '適合日常短暫休息時應用',
    'detailed': '3-3-3呼吸法，有助於快速放鬆、減少壓力和焦慮感。當您感到焦慮或壓力並需要快速恢復平靜時，這是一個很好的工具。',
    'inhale': '吸氣 3 秒',
    'hold': '屏息 3 秒',
    'exhale': '呼氣 3 秒',
  },
];